GopalSaraf/Practicals/PSDL/include/proc/pic16f19176.inc
// Register: LCDSE4
#define LCDSE4 LCDSE4
LCDSE4                                   equ 01D12h
// bitfield definitions
LCDSE4_SE32_POSN                         equ 0000h
LCDSE4_SE32_POSITION                     equ 0000h
LCDSE4_SE32_SIZE                         equ 0001h
LCDSE4_SE32_LENGTH                       equ 0001h
LCDSE4_SE32_MASK                         equ 0001h
LCDSE4_SE33_POSN                         equ 0001h
LCDSE4_SE33_POSITION                     equ 0001h
LCDSE4_SE33_SIZE                         equ 0001h
LCDSE4_SE33_LENGTH                       equ 0001h
LCDSE4_SE33_MASK                         equ 0002h
LCDSE4_SE34_POSN                         equ 0002h
LCDSE4_SE34_POSITION                     equ 0002h
LCDSE4_SE34_SIZE                         equ 0001h
LCDSE4_SE34_LENGTH                       equ 0001h
LCDSE4_SE34_MASK                         equ 0004h
LCDSE4_SE35_POSN                         equ 0003h
LCDSE4_SE35_POSITION                     equ 0003h
LCDSE4_SE35_SIZE                         equ 0001h
LCDSE4_SE35_LENGTH                       equ 0001h
LCDSE4_SE35_MASK                         equ 0008h
LCDSE4_SE36_POSN                         equ 0004h
LCDSE4_SE36_POSITION                     equ 0004h
LCDSE4_SE36_SIZE                         equ 0001h
LCDSE4_SE36_LENGTH                       equ 0001h
LCDSE4_SE36_MASK                         equ 0010h
LCDSE4_SE37_POSN                         equ 0005h
LCDSE4_SE37_POSITION                     equ 0005h
LCDSE4_SE37_SIZE                         equ 0001h
LCDSE4_SE37_LENGTH                       equ 0001h
LCDSE4_SE37_MASK                         equ 0020h
LCDSE4_SE38_POSN                         equ 0006h
LCDSE4_SE38_POSITION                     equ 0006h
LCDSE4_SE38_SIZE                         equ 0001h
LCDSE4_SE38_LENGTH                       equ 0001h
LCDSE4_SE38_MASK                         equ 0040h
LCDSE4_SE39_POSN                         equ 0007h
LCDSE4_SE39_POSITION                     equ 0007h
LCDSE4_SE39_SIZE                         equ 0001h
LCDSE4_SE39_LENGTH                       equ 0001h
LCDSE4_SE39_MASK                         equ 0080h

// Register: LCDSE5
#define LCDSE5 LCDSE5
LCDSE5                                   equ 01D13h
// bitfield definitions
LCDSE5_SE40_POSN                         equ 0000h
LCDSE5_SE40_POSITION                     equ 0000h
LCDSE5_SE40_SIZE                         equ 0001h
LCDSE5_SE40_LENGTH                       equ 0001h
LCDSE5_SE40_MASK                         equ 0001h
LCDSE5_SE41_POSN                         equ 0001h
LCDSE5_SE41_POSITION                     equ 0001h
LCDSE5_SE41_SIZE                         equ 0001h
LCDSE5_SE41_LENGTH                       equ 0001h
LCDSE5_SE41_MASK                         equ 0002h
LCDSE5_SE42_POSN                         equ 0002h
LCDSE5_SE42_POSITION                     equ 0002h
LCDSE5_SE42_SIZE                         equ 0001h
LCDSE5_SE42_LENGTH                       equ 0001h
LCDSE5_SE42_MASK                         equ 0004h
LCDSE5_SE43_POSN                         equ 0003h
LCDSE5_SE43_POSITION                     equ 0003h
LCDSE5_SE43_SIZE                         equ 0001h
LCDSE5_SE43_LENGTH                       equ 0001h
LCDSE5_SE43_MASK                         equ 0008h
LCDSE5_SE44_POSN                         equ 0004h
LCDSE5_SE44_POSITION                     equ 0004h
LCDSE5_SE44_SIZE                         equ 0001h
LCDSE5_SE44_LENGTH                       equ 0001h
LCDSE5_SE44_MASK                         equ 0010h
LCDSE5_SE45_POSN                         equ 0005h
LCDSE5_SE45_POSITION                     equ 0005h
LCDSE5_SE45_SIZE                         equ 0001h
LCDSE5_SE45_LENGTH                       equ 0001h
LCDSE5_SE45_MASK                         equ 0020h
LCDSE5_SE46_POSN                         equ 0006h
LCDSE5_SE46_POSITION                     equ 0006h
LCDSE5_SE46_SIZE                         equ 0001h
LCDSE5_SE46_LENGTH                       equ 0001h
LCDSE5_SE46_MASK                         equ 0040h
LCDSE5_SE47_POSN                         equ 0007h
LCDSE5_SE47_POSITION                     equ 0007h
LCDSE5_SE47_SIZE                         equ 0001h
LCDSE5_SE47_LENGTH                       equ 0001h
LCDSE5_SE47_MASK                         equ 0080h

// Register: LCDVCON1
#define LCDVCON1 LCDVCON1
LCDVCON1                                 equ 01D14h
// bitfield definitions
LCDVCON1_BIAS_POSN                       equ 0000h
LCDVCON1_BIAS_POSITION                   equ 0000h
LCDVCON1_BIAS_SIZE                       equ 0003h
LCDVCON1_BIAS_LENGTH                     equ 0003h
LCDVCON1_BIAS_MASK                       equ 0007h
LCDVCON1_EN5V_POSN                       equ 0006h
LCDVCON1_EN5V_POSITION                   equ 0006h
LCDVCON1_EN5V_SIZE                       equ 0001h
LCDVCON1_EN5V_LENGTH                     equ 0001h
LCDVCON1_EN5V_MASK                       equ 0040h
LCDVCON1_LPEN_POSN                       equ 0007h
LCDVCON1_LPEN_POSITION                   equ 0007h
LCDVCON1_LPEN_SIZE                       equ 0001h
LCDVCON1_LPEN_LENGTH                     equ 0001h
LCDVCON1_LPEN_MASK                       equ 0080h
LCDVCON1_BIAS0_POSN                      equ 0000h
LCDVCON1_BIAS0_POSITION                  equ 0000h
LCDVCON1_BIAS0_SIZE                      equ 0001h
LCDVCON1_BIAS0_LENGTH                    equ 0001h
LCDVCON1_BIAS0_MASK                      equ 0001h
LCDVCON1_BIAS1_POSN                      equ 0001h
LCDVCON1_BIAS1_POSITION                  equ 0001h
LCDVCON1_BIAS1_SIZE                      equ 0001h
LCDVCON1_BIAS1_LENGTH                    equ 0001h
LCDVCON1_BIAS1_MASK                      equ 0002h
LCDVCON1_BIAS2_POSN                      equ 0002h
LCDVCON1_BIAS2_POSITION                  equ 0002h
LCDVCON1_BIAS2_SIZE                      equ 0001h
LCDVCON1_BIAS2_LENGTH                    equ 0001h
LCDVCON1_BIAS2_MASK                      equ 0004h

// Register: LCDVCON2
#define LCDVCON2 LCDVCON2
LCDVCON2                                 equ 01D15h
// bitfield definitions
LCDVCON2_LCDVSRC_POSN                    equ 0000h
LCDVCON2_LCDVSRC_POSITION                equ 0000h
LCDVCON2_LCDVSRC_SIZE                    equ 0004h
LCDVCON2_LCDVSRC_LENGTH                  equ 0004h
LCDVCON2_LCDVSRC_MASK                    equ 000Fh
LCDVCON2_CPWDT_POSN                      equ 0007h
LCDVCON2_CPWDT_POSITION                  equ 0007h
LCDVCON2_CPWDT_SIZE                      equ 0001h
LCDVCON2_CPWDT_LENGTH                    equ 0001h
LCDVCON2_CPWDT_MASK                      equ 0080h
LCDVCON2_LCDVSRC0_POSN                   equ 0000h
LCDVCON2_LCDVSRC0_POSITION               equ 0000h
LCDVCON2_LCDVSRC0_SIZE                   equ 0001h
LCDVCON2_LCDVSRC0_LENGTH                 equ 0001h
LCDVCON2_LCDVSRC0_MASK                   equ 0001h
LCDVCON2_LCDVSRC1_POSN                   equ 0001h
LCDVCON2_LCDVSRC1_POSITION               equ 0001h
LCDVCON2_LCDVSRC1_SIZE                   equ 0001h
LCDVCON2_LCDVSRC1_LENGTH                 equ 0001h
LCDVCON2_LCDVSRC1_MASK                   equ 0002h
LCDVCON2_LCDVSRC2_POSN                   equ 0002h
LCDVCON2_LCDVSRC2_POSITION               equ 0002h
LCDVCON2_LCDVSRC2_SIZE                   equ 0001h
LCDVCON2_LCDVSRC2_LENGTH                 equ 0001h
LCDVCON2_LCDVSRC2_MASK                   equ 0004h
LCDVCON2_LCDVSRC3_POSN                   equ 0003h
LCDVCON2_LCDVSRC3_POSITION               equ 0003h
LCDVCON2_LCDVSRC3_SIZE                   equ 0001h
LCDVCON2_LCDVSRC3_LENGTH                 equ 0001h
LCDVCON2_LCDVSRC3_MASK                   equ 0008h

// Register: LCDREF
#define LCDREF LCDREF
LCDREF                                   equ 01D16h
// bitfield definitions
LCDREF_LCDCST_POSN                       equ 0000h
LCDREF_LCDCST_POSITION                   equ 0000h
LCDREF_LCDCST_SIZE                       equ 0003h
LCDREF_LCDCST_LENGTH                     equ 0003h
LCDREF_LCDCST_MASK                       equ 0007h
LCDREF_LCDCST0_POSN                      equ 0000h
LCDREF_LCDCST0_POSITION                  equ 0000h
LCDREF_LCDCST0_SIZE                      equ 0001h
LCDREF_LCDCST0_LENGTH                    equ 0001h
LCDREF_LCDCST0_MASK                      equ 0001h
LCDREF_LCDCST1_POSN                      equ 0001h
LCDREF_LCDCST1_POSITION                  equ 0001h
LCDREF_LCDCST1_SIZE                      equ 0001h
LCDREF_LCDCST1_LENGTH                    equ 0001h
LCDREF_LCDCST1_MASK                      equ 0002h
LCDREF_LCDCST2_POSN                      equ 0002h
LCDREF_LCDCST2_POSITION                  equ 0002h
LCDREF_LCDCST2_SIZE                      equ 0001h
LCDREF_LCDCST2_LENGTH                    equ 0001h
LCDREF_LCDCST2_MASK                      equ 0004h

// Register: LCDRL
#define LCDRL LCDRL
LCDRL                                    equ 01D17h
// bitfield definitions
LCDRL_LRLAT_POSN                         equ 0000h
LCDRL_LRLAT_POSITION                     equ 0000h
LCDRL_LRLAT_SIZE                         equ 0003h
LCDRL_LRLAT_LENGTH                       equ 0003h
LCDRL_LRLAT_MASK                         equ 0007h
LCDRL_LCDIRI_POSN                        equ 0003h
LCDRL_LCDIRI_POSITION                    equ 0003h
LCDRL_LCDIRI_SIZE                        equ 0001h
LCDRL_LCDIRI_LENGTH                      equ 0001h
LCDRL_LCDIRI_MASK                        equ 0008h
LCDRL_LRLBP_POSN                         equ 0004h
LCDRL_LRLBP_POSITION                     equ 0004h
LCDRL_LRLBP_SIZE                         equ 0002h
LCDRL_LRLBP_LENGTH                       equ 0002h
LCDRL_LRLBP_MASK                         equ 0030h
LCDRL_LRLAP_POSN                         equ 0006h
LCDRL_LRLAP_POSITION                     equ 0006h
LCDRL_LRLAP_SIZE                         equ 0002h
LCDRL_LRLAP_LENGTH                       equ 0002h
LCDRL_LRLAP_MASK                         equ 00C0h
LCDRL_LRLAT0_POSN                        equ 0000h
LCDRL_LRLAT0_POSITION                    equ 0000h
LCDRL_LRLAT0_SIZE                        equ 0001h
LCDRL_LRLAT0_LENGTH                      equ 0001h
LCDRL_LRLAT0_MASK                        equ 0001h
LCDRL_LRLAT1_POSN                        equ 0001h
LCDRL_LRLAT1_POSITION                    equ 0001h
LCDRL_LRLAT1_SIZE                        equ 0001h
LCDRL_LRLAT1_LENGTH                      equ 0001h
LCDRL_LRLAT1_MASK                        equ 0002h
LCDRL_LRLAT2_POSN                        equ 0002h
LCDRL_LRLAT2_POSITION                    equ 0002h
LCDRL_LRLAT2_SIZE                        equ 0001h
LCDRL_LRLAT2_LENGTH                      equ 0001h
LCDRL_LRLAT2_MASK                        equ 0004h
LCDRL_LRLBP0_POSN                        equ 0004h
LCDRL_LRLBP0_POSITION                    equ 0004h
LCDRL_LRLBP0_SIZE                        equ 0001h
LCDRL_LRLBP0_LENGTH                      equ 0001h
LCDRL_LRLBP0_MASK                        equ 0010h
LCDRL_LRLBP1_POSN                        equ 0005h
LCDRL_LRLBP1_POSITION                    equ 0005h
LCDRL_LRLBP1_SIZE                        equ 0001h
LCDRL_LRLBP1_LENGTH                      equ 0001h
LCDRL_LRLBP1_MASK                        equ 0020h
LCDRL_LRLAP0_POSN                        equ 0006h
LCDRL_LRLAP0_POSITION                    equ 0006h
LCDRL_LRLAP0_SIZE                        equ 0001h
LCDRL_LRLAP0_LENGTH                      equ 0001h
LCDRL_LRLAP0_MASK                        equ 0040h
LCDRL_LRLAP1_POSN                        equ 0007h
LCDRL_LRLAP1_POSITION                    equ 0007h
LCDRL_LRLAP1_SIZE                        equ 0001h
LCDRL_LRLAP1_LENGTH                      equ 0001h
LCDRL_LRLAP1_MASK                        equ 0080h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 01D18h
// bitfield definitions
LCDDATA0_S00C0_POSN                      equ 0000h
LCDDATA0_S00C0_POSITION                  equ 0000h
LCDDATA0_S00C0_SIZE                      equ 0001h
LCDDATA0_S00C0_LENGTH                    equ 0001h
LCDDATA0_S00C0_MASK                      equ 0001h
LCDDATA0_S01C0_POSN                      equ 0001h
LCDDATA0_S01C0_POSITION                  equ 0001h
LCDDATA0_S01C0_SIZE                      equ 0001h
LCDDATA0_S01C0_LENGTH                    equ 0001h
LCDDATA0_S01C0_MASK                      equ 0002h
LCDDATA0_S02C0_POSN                      equ 0002h
LCDDATA0_S02C0_POSITION                  equ 0002h
LCDDATA0_S02C0_SIZE                      equ 0001h
LCDDATA0_S02C0_LENGTH                    equ 0001h
LCDDATA0_S02C0_MASK                      equ 0004h
LCDDATA0_S03C0_POSN                      equ 0003h
LCDDATA0_S03C0_POSITION                  equ 0003h
LCDDATA0_S03C0_SIZE                      equ 0001h
LCDDATA0_S03C0_LENGTH                    equ 0001h
LCDDATA0_S03C0_MASK                      equ 0008h
LCDDATA0_S04C0_POSN                      equ 0004h
LCDDATA0_S04C0_POSITION                  equ 0004h
LCDDATA0_S04C0_SIZE                      equ 0001h
LCDDATA0_S04C0_LENGTH                    equ 0001h
LCDDATA0_S04C0_MASK                      equ 0010h
LCDDATA0_S06C0_POSN                      equ 0006h
LCDDATA0_S06C0_POSITION                  equ 0006h
LCDDATA0_S06C0_SIZE                      equ 0001h
LCDDATA0_S06C0_LENGTH                    equ 0001h
LCDDATA0_S06C0_MASK                      equ 0040h
LCDDATA0_S07C0_POSN                      equ 0007h
LCDDATA0_S07C0_POSITION                  equ 0007h
LCDDATA0_S07C0_SIZE                      equ 0001h
LCDDATA0_S07C0_LENGTH                    equ 0001h
LCDDATA0_S07C0_MASK                      equ 0080h

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
LCDDATA1                                 equ 01D19h
// bitfield definitions
LCDDATA1_S08C0_POSN                      equ 0000h
LCDDATA1_S08C0_POSITION                  equ 0000h
LCDDATA1_S08C0_SIZE                      equ 0001h
LCDDATA1_S08C0_LENGTH                    equ 0001h
LCDDATA1_S08C0_MASK                      equ 0001h
LCDDATA1_S09C0_POSN                      equ 0001h
LCDDATA1_S09C0_POSITION                  equ 0001h
LCDDATA1_S09C0_SIZE                      equ 0001h
LCDDATA1_S09C0_LENGTH                    equ 0001h
LCDDATA1_S09C0_MASK                      equ 0002h
LCDDATA1_S10C0_POSN                      equ 0002h
LCDDATA1_S10C0_POSITION                  equ 0002h
LCDDATA1_S10C0_SIZE                      equ 0001h
LCDDATA1_S10C0_LENGTH                    equ 0001h
LCDDATA1_S10C0_MASK                      equ 0004h
LCDDATA1_S11C0_POSN                      equ 0003h
LCDDATA1_S11C0_POSITION                  equ 0003h
LCDDATA1_S11C0_SIZE                      equ 0001h
LCDDATA1_S11C0_LENGTH                    equ 0001h
LCDDATA1_S11C0_MASK                      equ 0008h
LCDDATA1_S13C0_POSN                      equ 0005h
LCDDATA1_S13C0_POSITION                  equ 0005h
LCDDATA1_S13C0_SIZE                      equ 0001h
LCDDATA1_S13C0_LENGTH                    equ 0001h
LCDDATA1_S13C0_MASK                      equ 0020h
LCDDATA1_S14C0_POSN                      equ 0006h
LCDDATA1_S14C0_POSITION                  equ 0006h
LCDDATA1_S14C0_SIZE                      equ 0001h
LCDDATA1_S14C0_LENGTH                    equ 0001h
LCDDATA1_S14C0_MASK                      equ 0040h
LCDDATA1_S15C0_POSN                      equ 0007h
LCDDATA1_S15C0_POSITION                  equ 0007h
LCDDATA1_S15C0_SIZE                      equ 0001h
LCDDATA1_S15C0_LENGTH                    equ 0001h
LCDDATA1_S15C0_MASK                      equ 0080h

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 01D1Ah
// bitfield definitions
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 01D1Bh
// bitfield definitions
LCDDATA3_S24C0_POSN                      equ 0000h
LCDDATA3_S24C0_POSITION                  equ 0000h
LCDDATA3_S24C0_SIZE                      equ 0001h
LCDDATA3_S24C0_LENGTH                    equ 0001h
LCDDATA3_S24C0_MASK                      equ 0001h
LCDDATA3_S25C0_POSN                      equ 0001h
LCDDATA3_S25C0_POSITION                  equ 0001h
LCDDATA3_S25C0_SIZE                      equ 0001h
LCDDATA3_S25C0_LENGTH                    equ 0001h
LCDDATA3_S25C0_MASK                      equ 0002h
LCDDATA3_S26C0_POSN                      equ 0002h
LCDDATA3_S26C0_POSITION                  equ 0002h
LCDDATA3_S26C0_SIZE                      equ 0001h
LCDDATA3_S26C0_LENGTH                    equ 0001h
LCDDATA3_S26C0_MASK                      equ 0004h
LCDDATA3_S27C0_POSN                      equ 0003h
LCDDATA3_S27C0_POSITION                  equ 0003h
LCDDATA3_S27C0_SIZE                      equ 0001h
LCDDATA3_S27C0_LENGTH                    equ 0001h
LCDDATA3_S27C0_MASK                      equ 0008h
LCDDATA3_S28C0_POSN                      equ 0004h
LCDDATA3_S28C0_POSITION                  equ 0004h
LCDDATA3_S28C0_SIZE                      equ 0001h
LCDDATA3_S28C0_LENGTH                    equ 0001h
LCDDATA3_S28C0_MASK                      equ 0010h
LCDDATA3_S29C0_POSN                      equ 0005h
LCDDATA3_S29C0_POSITION                  equ 0005h
LCDDATA3_S29C0_SIZE                      equ 0001h
LCDDATA3_S29C0_LENGTH                    equ 0001h
LCDDATA3_S29C0_MASK                      equ 0020h
LCDDATA3_S30C0_POSN                      equ 0006h
LCDDATA3_S30C0_POSITION                  equ 0006h
LCDDATA3_S30C0_SIZE                      equ 0001h
LCDDATA3_S30C0_LENGTH                    equ 0001h
LCDDATA3_S30C0_MASK                      equ 0040h
LCDDATA3_S31C0_POSN                      equ 0007h
LCDDATA3_S31C0_POSITION                  equ 0007h
LCDDATA3_S31C0_SIZE                      equ 0001h
LCDDATA3_S31C0_LENGTH                    equ 0001h
LCDDATA3_S31C0_MASK                      equ 0080h

