GopalSaraf/Practicals/PSDL/include/proc/pic16f19176.inc
#define RB1                              BANKMASK(PORTB), 1
#define RB1PPS0                          BANKMASK(RB1PPS), 0
#define RB1PPS1                          BANKMASK(RB1PPS), 1
#define RB1PPS2                          BANKMASK(RB1PPS), 2
#define RB1PPS3                          BANKMASK(RB1PPS), 3
#define RB1PPS4                          BANKMASK(RB1PPS), 4
#define RB2                              BANKMASK(PORTB), 2
#define RB2PPS0                          BANKMASK(RB2PPS), 0
#define RB2PPS1                          BANKMASK(RB2PPS), 1
#define RB2PPS2                          BANKMASK(RB2PPS), 2
#define RB2PPS3                          BANKMASK(RB2PPS), 3
#define RB2PPS4                          BANKMASK(RB2PPS), 4
#define RB3                              BANKMASK(PORTB), 3
#define RB3PPS0                          BANKMASK(RB3PPS), 0
#define RB3PPS1                          BANKMASK(RB3PPS), 1
#define RB3PPS2                          BANKMASK(RB3PPS), 2
#define RB3PPS3                          BANKMASK(RB3PPS), 3
#define RB3PPS4                          BANKMASK(RB3PPS), 4
#define RB4                              BANKMASK(PORTB), 4
#define RB4PPS0                          BANKMASK(RB4PPS), 0
#define RB4PPS1                          BANKMASK(RB4PPS), 1
#define RB4PPS2                          BANKMASK(RB4PPS), 2
#define RB4PPS3                          BANKMASK(RB4PPS), 3
#define RB4PPS4                          BANKMASK(RB4PPS), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB5PPS0                          BANKMASK(RB5PPS), 0
#define RB5PPS1                          BANKMASK(RB5PPS), 1
#define RB5PPS2                          BANKMASK(RB5PPS), 2
#define RB5PPS3                          BANKMASK(RB5PPS), 3
#define RB5PPS4                          BANKMASK(RB5PPS), 4
#define RB6                              BANKMASK(PORTB), 6
#define RB6PPS0                          BANKMASK(RB6PPS), 0
#define RB6PPS1                          BANKMASK(RB6PPS), 1
#define RB6PPS2                          BANKMASK(RB6PPS), 2
#define RB6PPS3                          BANKMASK(RB6PPS), 3
#define RB6PPS4                          BANKMASK(RB6PPS), 4
#define RB7                              BANKMASK(PORTB), 7
#define RB7PPS0                          BANKMASK(RB7PPS), 0
#define RB7PPS1                          BANKMASK(RB7PPS), 1
#define RB7PPS2                          BANKMASK(RB7PPS), 2
#define RB7PPS3                          BANKMASK(RB7PPS), 3
#define RB7PPS4                          BANKMASK(RB7PPS), 4
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE3), 5
#define RC1IF                            BANKMASK(PIR3), 5
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC2                              BANKMASK(PORTC), 2
#define RC2IE                            BANKMASK(PIE3), 7
#define RC2IF                            BANKMASK(PIR3), 7
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC6                              BANKMASK(PORTC), 6
#define RC6PPS0                          BANKMASK(RC6PPS), 0
#define RC6PPS1                          BANKMASK(RC6PPS), 1
#define RC6PPS2                          BANKMASK(RC6PPS), 2
#define RC6PPS3                          BANKMASK(RC6PPS), 3
#define RC6PPS4                          BANKMASK(RC6PPS), 4
#define RC7                              BANKMASK(PORTC), 7
#define RC7PPS0                          BANKMASK(RC7PPS), 0
#define RC7PPS1                          BANKMASK(RC7PPS), 1
#define RC7PPS2                          BANKMASK(RC7PPS), 2
#define RC7PPS3                          BANKMASK(RC7PPS), 3
#define RC7PPS4                          BANKMASK(RC7PPS), 4
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RD                               BANKMASK(NVMCON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD0PPS0                          BANKMASK(RD0PPS), 0
#define RD0PPS1                          BANKMASK(RD0PPS), 1
#define RD0PPS2                          BANKMASK(RD0PPS), 2
#define RD0PPS3                          BANKMASK(RD0PPS), 3
#define RD0PPS4                          BANKMASK(RD0PPS), 4
#define RD1                              BANKMASK(PORTD), 1
#define RD16                             BANKMASK(T1CON), 1
#define RD161                            BANKMASK(T1CON), 1
#define RD1PPS0                          BANKMASK(RD1PPS), 0
#define RD1PPS1                          BANKMASK(RD1PPS), 1
#define RD1PPS2                          BANKMASK(RD1PPS), 2
#define RD1PPS3                          BANKMASK(RD1PPS), 3
#define RD1PPS4                          BANKMASK(RD1PPS), 4
#define RD2                              BANKMASK(PORTD), 2
#define RD2PPS0                          BANKMASK(RD2PPS), 0
#define RD2PPS1                          BANKMASK(RD2PPS), 1
#define RD2PPS2                          BANKMASK(RD2PPS), 2
#define RD2PPS3                          BANKMASK(RD2PPS), 3
#define RD2PPS4                          BANKMASK(RD2PPS), 4
#define RD3                              BANKMASK(PORTD), 3
#define RD3PPS0                          BANKMASK(RD3PPS), 0
#define RD3PPS1                          BANKMASK(RD3PPS), 1
#define RD3PPS2                          BANKMASK(RD3PPS), 2
#define RD3PPS3                          BANKMASK(RD3PPS), 3
#define RD3PPS4                          BANKMASK(RD3PPS), 4
#define RD4                              BANKMASK(PORTD), 4
#define RD4PPS0                          BANKMASK(RD4PPS), 0
#define RD4PPS1                          BANKMASK(RD4PPS), 1
#define RD4PPS2                          BANKMASK(RD4PPS), 2
#define RD4PPS3                          BANKMASK(RD4PPS), 3
#define RD4PPS4                          BANKMASK(RD4PPS), 4
#define RD5                              BANKMASK(PORTD), 5
#define RD5PPS0                          BANKMASK(RD5PPS), 0
#define RD5PPS1                          BANKMASK(RD5PPS), 1
#define RD5PPS2                          BANKMASK(RD5PPS), 2
#define RD5PPS3                          BANKMASK(RD5PPS), 3
#define RD5PPS4                          BANKMASK(RD5PPS), 4
#define RD6                              BANKMASK(PORTD), 6
#define RD6PPS0                          BANKMASK(RD6PPS), 0
#define RD6PPS1                          BANKMASK(RD6PPS), 1
#define RD6PPS2                          BANKMASK(RD6PPS), 2
#define RD6PPS3                          BANKMASK(RD6PPS), 3
#define RD6PPS4                          BANKMASK(RD6PPS), 4
#define RD7                              BANKMASK(PORTD), 7
#define RD7PPS0                          BANKMASK(RD7PPS), 0
#define RD7PPS1                          BANKMASK(RD7PPS), 1
#define RD7PPS2                          BANKMASK(RD7PPS), 2
#define RD7PPS3                          BANKMASK(RD7PPS), 3
#define RD7PPS4                          BANKMASK(RD7PPS), 4
#define RE0                              BANKMASK(PORTE), 0
#define RE0PPS0                          BANKMASK(RE0PPS), 0
#define RE0PPS1                          BANKMASK(RE0PPS), 1
#define RE0PPS2                          BANKMASK(RE0PPS), 2
#define RE0PPS3                          BANKMASK(RE0PPS), 3
#define RE0PPS4                          BANKMASK(RE0PPS), 4
#define RE1                              BANKMASK(PORTE), 1
#define RE1PPS0                          BANKMASK(RE1PPS), 0
#define RE1PPS1                          BANKMASK(RE1PPS), 1
#define RE1PPS2                          BANKMASK(RE1PPS), 2
#define RE1PPS3                          BANKMASK(RE1PPS), 3
#define RE1PPS4                          BANKMASK(RE1PPS), 4
#define RE2                              BANKMASK(PORTE), 2
#define RE2PPS0                          BANKMASK(RE2PPS), 0
#define RE2PPS1                          BANKMASK(RE2PPS), 1
#define RE2PPS2                          BANKMASK(RE2PPS), 2
#define RE2PPS3                          BANKMASK(RE2PPS), 3
#define RE2PPS4                          BANKMASK(RE2PPS), 4
#define RE3                              BANKMASK(PORTE), 3
#define READ_WRITE                       BANKMASK(SSP1STAT), 2
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define REN                              BANKMASK(CWG1AS0), 6
#define REPEAT                           BANKMASK(SMT1CON1), 6
#define RES0                             BANKMASK(ADRESL), 0
#define RES1                             BANKMASK(ADRESL), 1
#define RES10                            BANKMASK(ADRESH), 2
#define RES11                            BANKMASK(ADRESH), 3
#define RES12                            BANKMASK(ADRESH), 4
#define RES13                            BANKMASK(ADRESH), 5
#define RES14                            BANKMASK(ADRESH), 6
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define ROI                              BANKMASK(CPUDOZE), 5
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RST                              BANKMASK(SMT1STAT), 5
#define RTCCIE                           BANKMASK(PIE8), 6
#define RTCCIF                           BANKMASK(PIR8), 6
#define RTCCLKSEL0                       BANKMASK(RTCCON), 0
#define RTCCLKSEL1                       BANKMASK(RTCCON), 1
#define RTCCMD                           BANKMASK(PMD2), 7
#define RTCEN                            BANKMASK(RTCCON), 7
#define RTCSYNC                          BANKMASK(RTCCON), 4
#define RTCWREN                          BANKMASK(RTCCON), 5
#define RW                               BANKMASK(SSP1STAT), 2
#define RW1                              BANKMASK(SSP1STAT), 2
#define RX1PPS0                          BANKMASK(RX1PPS), 0
#define RX1PPS1                          BANKMASK(RX1PPS), 1
#define RX1PPS2                          BANKMASK(RX1PPS), 2
#define RX1PPS3                          BANKMASK(RX1PPS), 3
#define RX1PPS4                          BANKMASK(RX1PPS), 4
#define RX2PPS0                          BANKMASK(RX2PPS), 0
#define RX2PPS1                          BANKMASK(RX2PPS), 1
#define RX3PPS2                          BANKMASK(RX2PPS), 2
#define RX4PPS3                          BANKMASK(RX2PPS), 3
#define RX5PPS4                          BANKMASK(RX2PPS), 4
#define R_W                              BANKMASK(SSP1STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_nW                             BANKMASK(SSP1STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define S00C0                            BANKMASK(LCDDATA0), 0
#define S00C1                            BANKMASK(LCDDATA6), 0
#define S00C2                            BANKMASK(LCDDATA12), 0
#define S00C3                            BANKMASK(LCDDATA18), 0
#define S00C4                            BANKMASK(LCDDATA24), 0
#define S00C5                            BANKMASK(LCDDATA30), 0
#define S00C6                            BANKMASK(LCDDATA36), 0
#define S00C7                            BANKMASK(LCDDATA42), 0
#define S01C0                            BANKMASK(LCDDATA0), 1
#define S01C1                            BANKMASK(LCDDATA6), 1
#define S01C2                            BANKMASK(LCDDATA12), 1
#define S01C3                            BANKMASK(LCDDATA18), 1
#define S01C4                            BANKMASK(LCDDATA24), 1
#define S01C5                            BANKMASK(LCDDATA30), 1
#define S01C6                            BANKMASK(LCDDATA36), 1
#define S01C7                            BANKMASK(LCDDATA42), 1
#define S02C0                            BANKMASK(LCDDATA0), 2
#define S02C1                            BANKMASK(LCDDATA6), 2
#define S02C2                            BANKMASK(LCDDATA12), 2
#define S02C3                            BANKMASK(LCDDATA18), 2
#define S02C4                            BANKMASK(LCDDATA24), 2
#define S02C5                            BANKMASK(LCDDATA30), 2
#define S02C6                            BANKMASK(LCDDATA36), 2
#define S02C7                            BANKMASK(LCDDATA42), 2
#define S03C0                            BANKMASK(LCDDATA0), 3
#define S03C1                            BANKMASK(LCDDATA6), 3
#define S03C2                            BANKMASK(LCDDATA12), 3
#define S03C3                            BANKMASK(LCDDATA18), 3
#define S03C4                            BANKMASK(LCDDATA24), 3
#define S03C5                            BANKMASK(LCDDATA30), 3
#define S03C6                            BANKMASK(LCDDATA36), 3
#define S03C7                            BANKMASK(LCDDATA42), 3
#define S04C0                            BANKMASK(LCDDATA0), 4
#define S04C1                            BANKMASK(LCDDATA6), 4
#define S04C2                            BANKMASK(LCDDATA12), 4
#define S04C3                            BANKMASK(LCDDATA18), 4
#define S04C4                            BANKMASK(LCDDATA24), 4
#define S04C5                            BANKMASK(LCDDATA30), 4
#define S04C6                            BANKMASK(LCDDATA36), 4
#define S04C7                            BANKMASK(LCDDATA42), 4
#define S06C0                            BANKMASK(LCDDATA0), 6
#define S06C1                            BANKMASK(LCDDATA6), 6
#define S06C2                            BANKMASK(LCDDATA12), 6
#define S06C3                            BANKMASK(LCDDATA18), 6
#define S06C4                            BANKMASK(LCDDATA24), 6
#define S06C5                            BANKMASK(LCDDATA30), 6
#define S06C6                            BANKMASK(LCDDATA36), 6
#define S06C7                            BANKMASK(LCDDATA42), 6
#define S07C0                            BANKMASK(LCDDATA0), 7
#define S07C1                            BANKMASK(LCDDATA6), 7
#define S07C2                            BANKMASK(LCDDATA12), 7
#define S07C3                            BANKMASK(LCDDATA18), 7
#define S07C4                            BANKMASK(LCDDATA24), 7
#define S07C5                            BANKMASK(LCDDATA30), 7
#define S07C6                            BANKMASK(LCDDATA36), 7
#define S07C7                            BANKMASK(LCDDATA42), 7
#define S08C0                            BANKMASK(LCDDATA1), 0
#define S08C1                            BANKMASK(LCDDATA7), 0
#define S08C2                            BANKMASK(LCDDATA13), 0
#define S08C3                            BANKMASK(LCDDATA19), 0
#define S08C4                            BANKMASK(LCDDATA25), 0
#define S08C5                            BANKMASK(LCDDATA31), 0
#define S08C6                            BANKMASK(LCDDATA37), 0
#define S08C7                            BANKMASK(LCDDATA43), 0
#define S09C0                            BANKMASK(LCDDATA1), 1
#define S09C1                            BANKMASK(LCDDATA7), 1
#define S09C2                            BANKMASK(LCDDATA13), 1
#define S09C3                            BANKMASK(LCDDATA19), 1
#define S09C4                            BANKMASK(LCDDATA25), 1
#define S09C5                            BANKMASK(LCDDATA31), 1
#define S09C6                            BANKMASK(LCDDATA37), 1
#define S09C7                            BANKMASK(LCDDATA43), 1
#define S10C0                            BANKMASK(LCDDATA1), 2
#define S10C1                            BANKMASK(LCDDATA7), 2
#define S10C2                            BANKMASK(LCDDATA13), 2
#define S10C3                            BANKMASK(LCDDATA19), 2
#define S10C4                            BANKMASK(LCDDATA25), 2
#define S10C5                            BANKMASK(LCDDATA31), 2
#define S10C6                            BANKMASK(LCDDATA37), 2
#define S10C7                            BANKMASK(LCDDATA43), 2
#define S11C0                            BANKMASK(LCDDATA1), 3
#define S11C1                            BANKMASK(LCDDATA7), 3
#define S11C2                            BANKMASK(LCDDATA13), 3
#define S11C3                            BANKMASK(LCDDATA19), 3
#define S11C4                            BANKMASK(LCDDATA25), 3
#define S11C5                            BANKMASK(LCDDATA31), 3
#define S11C6                            BANKMASK(LCDDATA37), 3
#define S11C7                            BANKMASK(LCDDATA43), 3
#define S13C0                            BANKMASK(LCDDATA1), 5
#define S13C1                            BANKMASK(LCDDATA7), 5
#define S13C2                            BANKMASK(LCDDATA13), 5
#define S13C3                            BANKMASK(LCDDATA19), 5
#define S13C4                            BANKMASK(LCDDATA25), 5
#define S13C5                            BANKMASK(LCDDATA31), 5
#define S13C6                            BANKMASK(LCDDATA37), 5
#define S13C7                            BANKMASK(LCDDATA43), 5
#define S14C0                            BANKMASK(LCDDATA1), 6
#define S14C1                            BANKMASK(LCDDATA7), 6
#define S14C2                            BANKMASK(LCDDATA13), 6
#define S14C3                            BANKMASK(LCDDATA19), 6
#define S14C4                            BANKMASK(LCDDATA25), 6
#define S14C5                            BANKMASK(LCDDATA31), 6
#define S14C6                            BANKMASK(LCDDATA37), 6
#define S14C7                            BANKMASK(LCDDATA43), 6
#define S15C0                            BANKMASK(LCDDATA1), 7
#define S15C1                            BANKMASK(LCDDATA7), 7
#define S15C2                            BANKMASK(LCDDATA13), 7
#define S15C3                            BANKMASK(LCDDATA19), 7
#define S15C4                            BANKMASK(LCDDATA25), 7
#define S15C5                            BANKMASK(LCDDATA31), 7
#define S15C6                            BANKMASK(LCDDATA37), 7
#define S15C7                            BANKMASK(LCDDATA43), 7
#define S18C0                            BANKMASK(LCDDATA2), 2
#define S18C1                            BANKMASK(LCDDATA8), 2
#define S18C2                            BANKMASK(LCDDATA14), 2
#define S18C3                            BANKMASK(LCDDATA20), 2
#define S18C4                            BANKMASK(LCDDATA26), 2
#define S18C5                            BANKMASK(LCDDATA32), 2
#define S18C6                            BANKMASK(LCDDATA38), 2
#define S18C7                            BANKMASK(LCDDATA44), 2
#define S19C0                            BANKMASK(LCDDATA2), 3
#define S19C1                            BANKMASK(LCDDATA8), 3
#define S19C2                            BANKMASK(LCDDATA14), 3
#define S19C3                            BANKMASK(LCDDATA20), 3
#define S19C4                            BANKMASK(LCDDATA26), 3
#define S19C5                            BANKMASK(LCDDATA32), 3
#define S19C6                            BANKMASK(LCDDATA38), 3
#define S19C7                            BANKMASK(LCDDATA44), 3
#define S2                               BANKMASK(SSP1STAT), 3
#define S20C0                            BANKMASK(LCDDATA2), 4
#define S20C1                            BANKMASK(LCDDATA8), 4
#define S20C2                            BANKMASK(LCDDATA14), 4
#define S20C3                            BANKMASK(LCDDATA20), 4
#define S20C4                            BANKMASK(LCDDATA26), 4
#define S20C5                            BANKMASK(LCDDATA32), 4
#define S20C6                            BANKMASK(LCDDATA38), 4
#define S20C7                            BANKMASK(LCDDATA44), 4
#define S22C0                            BANKMASK(LCDDATA2), 6
#define S22C1                            BANKMASK(LCDDATA8), 6
#define S22C2                            BANKMASK(LCDDATA14), 6
#define S22C3                            BANKMASK(LCDDATA20), 6
#define S22C4                            BANKMASK(LCDDATA26), 6
#define S22C5                            BANKMASK(LCDDATA32), 6
#define S22C6                            BANKMASK(LCDDATA38), 6
#define S22C7                            BANKMASK(LCDDATA44), 6
#define S23C0                            BANKMASK(LCDDATA2), 7
#define S23C1                            BANKMASK(LCDDATA8), 7
#define S23C2                            BANKMASK(LCDDATA14), 7
#define S23C3                            BANKMASK(LCDDATA20), 7
#define S23C4                            BANKMASK(LCDDATA26), 7
#define S23C5                            BANKMASK(LCDDATA32), 7
#define S23C6                            BANKMASK(LCDDATA38), 7
#define S23C7                            BANKMASK(LCDDATA44), 7
#define S24C0                            BANKMASK(LCDDATA3), 0
#define S24C1                            BANKMASK(LCDDATA9), 0
#define S24C2                            BANKMASK(LCDDATA15), 0
#define S24C3                            BANKMASK(LCDDATA21), 0
#define S24C4                            BANKMASK(LCDDATA27), 0
#define S24C5                            BANKMASK(LCDDATA33), 0
#define S24C6                            BANKMASK(LCDDATA39), 0
#define S24C7                            BANKMASK(LCDDATA45), 0
#define S25C0                            BANKMASK(LCDDATA3), 1
#define S25C1                            BANKMASK(LCDDATA9), 1
#define S25C2                            BANKMASK(LCDDATA15), 1
#define S25C3                            BANKMASK(LCDDATA21), 1
#define S25C4                            BANKMASK(LCDDATA27), 1
#define S25C5                            BANKMASK(LCDDATA33), 1
#define S25C6                            BANKMASK(LCDDATA39), 1
#define S25C7                            BANKMASK(LCDDATA45), 1
#define S26C0                            BANKMASK(LCDDATA3), 2
